package com.atguigu.java;

/**
 * @author：ZhouYao
 * @create：2021-09-20 17:59
 */

/*
 * 一、学习面向对象内容的三条主线
 * 1.Java 类及类的成员：属性、方法、构造器、代码块、内部类
 * 2.面向对象的三大特征：封装、继承、多态性、(抽象性)
 * 3.其它关键字：this、super、static、final、abstract、interface、package、import 等
 *
 * 二、人把大象装进冰箱
 * 1.面向过程:强调的是功能行为，以函数为最小单位，考虑怎么做。
 *
 * ① 打开冰箱
 * ② 把大象装进冰箱
 * ③ 把冰箱门关住
 *
 * 2.面向对象:强调具备了功能的对象，以类/对象为最小单位，考虑谁来做。
 * 人{
 * 		打开(冰箱){
 * 			冰箱.开门();
 * 		}操作(大象){
 * 			大象.进入(冰箱);
 * 		}关闭(冰箱){
 * 			 冰箱.关门();
 * 		}
 * }
 *
 * 冰箱{
 * 		开门(){
 * 		}
 * 		关门(){
 * 		}
 * }
 *
 * 大象{
 * 		进入(冰箱){
 * 		}
 * }
 */

/*
 * 三、面向对象的两个要素：
 * 类:对一类事物的描述，是抽象的、概念上的定义
 * 对象:是实际存在的该类事物的每个个体，因而也称为实	例(instance)。
 * 可以理解为：类= 抽象概念的人；对象= 实实在在的某个人
 * 面向对象程序设计的重点是类的设计；
 * 设计类，其实就是设计类的成员。
 */



public class OOPTest {
}
